Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Reunion.tmx
Source language: en
Languages: es_419

source: anyway, call me Bas, it’s short for Obasi! pretty cool, right?
es_419: en fin, llámame bas. ¡es la abreviatura de obasi! original, ¿eh?

source: i don’t think anyone would choose to be a vigilante for fun. it’s dangerous, and you’d be risking a lot.
es_419: no creo que nadie elija ser un justiciero por diversión. es peligroso y se arriesga mucho.

source: someone ordered an extra large?
es_419: ¿alguien pidió un extragrande?

source: wow, look at all the cool stuff around here!
es_419: uuy, ¡cuántas cosas geniales hay aquí!

source: i would love to.
es_419: me encantaría.

source: can’t explain it. let’s just say...
es_419: no puedo explicarlo. es que…

source: a moment of silence to support our fellow brother, who, in spite of his romantic challenges, did his best til the very end.
es_419: un minuto de silencio para apoyar al hermano que, carente de habilidades de conquistador romántico, dio lo mejor hasta el final.

source: hah, no! i’m just a friend! we used to go to school together, that’s all!
es_419: ¡ay, no! ¡solo soy su amiga! íbamos juntos a la escuela, eso es todo.

source: just make sure you’ll be awake next time, kay?
es_419: solo asegúrate de estar despierta la próxima, ¿eh?

source: someone around here has really high standards...
es_419: alguien tiene estándares muy altos…

source: shiro, all the news i’ve been seeing, the vigilantes they’ve been reporting about…
es_419: shiro, los justicieros sobre los que hablan en todos los canales de noticias…

source: people like us are not meant to share a life with others.
es_419: la gente como nosotros no está destinada a compartir su vida.

source: ...to hang out with you.
es_419: … pasar tiempo contigo.

source: hey, kori. i’m sorry for keeping you waiting.
es_419: hola, kori. perdón por hacerte esperar.

source: it can get a little rowdy, so it’s not surprising that he wanted to move out. no hard feelings.
es_419: suele haber bastante agitación, y por eso no me sorprendió que él se mudara. lo entendí perfectamente.

source: are you okay?
es_419: ¿estás bien?

source: i don’t “disappear”, i just have other responsibilities too. believe me, nothing about this is convenient-
es_419: no “desaparezco”, es que tengo otras responsabilidades. créeme, nada de esto es conveniente para mí…

source: but the thing is...
es_419: pero el asunto es…

source: hey, slow down girl. where are you off to in such a hurry?
es_419: eh, más despacio, preciosa. ¿a dónde vas con tanta prisa?

source: this is your last chance...!
es_419: ¡es tu última oportunidad!…

source: and that jacket, i know it’s not yours.
es_419: y esa chaqueta no es tuya.

source: i didn’t know where you went, or if you were okay, not even a simple text to let me know you’re alive.
es_419: no sabía adónde habías ido ni si estabas bien. no enviaste un solo mensaje para decirme que estabas vivo.

source: y’know, you never really told me what your job is. what does your family do, exactly?
es_419: nunca me contaste en qué consiste tu empleo. ¿qué hace tu familia exactamente?

source: hurry up!
es_419: ¡rápido!

source: suuure, but i can’t go too crazy, i don’t wanna rock up to an interview looking washed, y’know?
es_419: ¡claro que sí! pero no debo enloquecer demasiado. no puedo ir dormida a una entrevista.

source: hehe, that’s what they all say...
es_419: je, je, es lo que dicen todos…

source: well, you were behaving like a dick the whole night...
es_419: bueno, te portaste como un idiota con ella…

source: i um... saw you outside with someone. she seemed important so i didn’t want to interrupt...
es_419: yo… te vi hablar con alguien. parecía importante, así que no quise interrumpir…

source: what do you think you’re doing?
es_419: ¿qué crees que estás haciendo?

source: i deserve a man who will put me first, not someone who makes me feel like an afterthough, or some toy to play with when he is bored.
es_419: merezco a un hombre que me considere su prioridad. no quiero a alguien que me haga sentir una segundona o un juguete para cuando se aburre.

source: ...is everything good, man?
es_419: … ¿va todo bien?

source: we have never done anything more than that.
es_419: no hay nada más que eso.

source: nothing at all, really! we haven’t spoken to each other as much as we used to, and i guess i’m just trying to reconnect?
es_419: ¡realmente, nada! no hablamos tanto como cuando éramos niños. supongo que estoy tratando de volver a conectar con él.

source: don’t get caught then.
es_419: mm, no te dejes atrapar.

source: ay shiro, you up?
es_419: shiro, ¿estás despierto?

source: well, there were plenty of men who were injured last night, but none fit the description you gave us.
es_419: bueno, muchos hombres resultaron heridos anoche, pero ninguno con la descripción que nos diste.

source: deep down, i know it’s just easier to let them go than to watch them leave when they know the truth.
es_419: en el fondo, sé que es más fácil dejar ir a esas personas que verlas salir huyendo cuando saben la verdad.

source: but why do you guys do this? why can’t you quit and choose to live a normal life?
es_419: pero ¿por qué lo hacen? ¿por qué no pueden dejarlo y tener una vida normal?

source: and it’s really none of my business, but you left your first aid out on your dresser...
es_419: y realmente no es problema mío, pero dejaste tu botiquín sobre la cómoda…

source: shiro! sweet baby jesus you’re ALIVE!
es_419: ¡shiro! ¡madre santísima, estás vivo!

source: yeah. i thought so too.
es_419: sí, yo también lo pensé.

source: if i was seeing someone, i would’ve told you before.
es_419: si estuviera saliendo con alguien, te lo habría dicho.

source: thanks! heh.
es_419: ¡gracias! je.

source: yeah, everything is fine.
es_419: sí, todo está bien.

source: oh yeah, you’re not wrong.
es_419: y no te equivocaste.

source: ugh, yeah. long distance is hard! don’t ever do that unless you’re prepared to deal with the heartache.
es_419: uf, sí. ¡las relaciones a distancia son difíciles! nunca lo hagas, a menos que puedas aguantar la pena.

source: ...even when it comes with a price.
es_419: … aunque conlleve un precio.

source: i’m tired.
es_419: estoy cansado…

source: the errands, i mean. cuz y’know, since we’re both here, do you maybe want to grab a bite? or just a drink?
es_419: digo, lo que tenías pendiente. porque ya que estamos aquí, ¿te gustaría ir a comer? ¿o a tomar algo?

source: many believe he is a member of an underground vigilante organisation that are responsible for numerous heroic acts across the city in the past decade.
es_419: "muchos creen que es miembro de una organización clandestina de justicieros que han llevado a cabo numerosos actos heroicos en la ciudad en la última década".

source: hey... that’s the kid everyone is talking about, right?
es_419: oye… ese es el chico del que todos hablan, ¿no?

source: ...i’d never have you.
es_419: … tú no estarías aquí.

source: um, yeah. there really isn’t anything else, is there?
es_419: mm, sí. siempre lo mismo ¿verdad?

source: YOU’RE batman and I’M robin?!
es_419: ¡¿tú eres batman y yo soy robin?!

source: hmph.
es_419: uuf.

source: um... heya?
es_419: mm… ¿hola?

source: were you protecting me, or just trying to protect yourself?
es_419: ¿de protegerme a mí o de protegerte a ti mismo?

source: your dad’s calling. i guess you have to go?
es_419: tu papá te está llamando. debes irte, ¿no?

source: i’m sorry about everything.
es_419: lamento todo lo que hice.

source: it really won’t be the same without you here.
es_419: no será lo mismo si no estás.

source: huh? why wouldn’t i be?
es_419: ¿por qué no lo estaría?

source: maybe it isn’t so awkward for me to take off now?
es_419: si salgo ahora, quizá no sea tan incómodo.

source: no, that’s it!
es_419: ¡basta!

source: i’m not really...
es_419: en realidad no…

source: wait, you got stood up?
es_419: espera, ¿te plantó?

source: OH, yeah, no problem-
es_419: sí, claro, de nada…

source: hey, don’t worry!
es_419: ¡oye, no te preocupes!

source: hah, you... you’re the one who was at the shop that day.
es_419: ja, tú… tú eras el que estaba en la tienda ese día.

source: ay yo, we got anymore dip in the fridge?
es_419: oye, ¿tenemos aderezo en el refrigerador?

source: i could’ve dropped a pretty mean punch, y’know.
es_419: podría haberles dado un buen puñetazo, ¿sabes?

source: um... sorry, is there a reason why you’re asking? have we met by any chance?
es_419: mmm… lo siento, ¿lo preguntas por algo? ¿nos conocemos?

source: oh. my family?
es_419: ah… ¿mi familia?

source: um, sure? and this man is... shiro?
es_419: mm, ¿segura? ¿te refieres a… shiro?

source: mm-hmm, that’s definitely a girl.
es_419: ajá, sí. sin duda es una chica.

source: he’s one of them.
es_419: es uno de ellos.

source: you will need to think very carefully about your decisions from now on.
es_419: desde ahora, tendrás que considerar cuidadosamente tus decisiones.

source: oh yeah, kids at school used to talk about that a lot.
es_419: sí, en la escuela los niños solían mencionarlo.

source: actually, i’ve got something to do later.
es_419: yo sí tengo algo que hacer más tarde.

source: but still, this is really hard for me, and i don’t want things to change between us.
es_419: pero, aún así, esto es muy difícil para mí y no quiero que las cosas cambien entre nosotros.

source: the cops call them criminals, and some people think they’re inspiring more violence than saving lives...
es_419: los policías los llaman criminales, y algunos piensan que es más la violencia que despiertan que las vidas que salvan…

source: i for one think she’s in love with you.
es_419: yo opino que está enamorada de ti.

source: i’ll be outside.
es_419: estaré afuera.

source: y’know, he said the same thing to me twenty-three years ago, and I never listened.
es_419: ¿sabes?, él me dijo lo mismo hace veintitrés años y no le hice caso.

source: nah. i’m good.
es_419: prefiero ver.

source: maybe we could get some snacks first!
es_419: ¡podríamos buscar algo para comer!

source: you think everyone is in love with me.
es_419: tú opinas que todas lo están.

source: hey man! i was just returning the shirt i borrowed the last time. didn’t know you were out, my bad.
es_419: ¡hola, viejo! vine a devolverte la camisa que me prestaste. no sabía que no estabas, lo siento.

source: don’t worry, it’s on the house! we don’t get many customers like yourself anymore.
es_419: ¡no te preocupes, invita la casa! ya no quedan muchos clientes como tú.

source: mm, no idea what you’re talking about.
es_419: mm, no sé de qué me hablas.

source: the what-?
es_419: ¿la qué…?

source: oh, you don’t have to worry about that. i’ll walk you home.
es_419: ah, no es necesario. te acompañaré a casa.

source: hm? did shiro not tell you? most of the family live here. that’s three generations, by the way.
es_419: ¿shiro no te lo dijo? la mayor parte de la familia vive aquí. ya somos tres generaciones.

source: aww, really? thanks!
es_419: aay, ¿en serio? ¡gracias!

source: yeah, but... everything about me and my family spells trouble. aren’t you afraid?
es_419: pero todo lo que nos rodea garantiza problemas. ¿no tienes miedo?

source: finally. am i cleared yet?
es_419: por fin. ¿me puedo ir?

source: yeah. my bedroom.
es_419: sería mi habitación.

source: i don’t wanna butt in, but you know why i’m asking, right?
es_419: no quiero entrometerme, pero sabes por qué te lo pregunto.

source: wait, girls like me?
es_419: aguarda, ¿en serio?

source: y-yes sir...
es_419: s-sí señor…

source: sure.
es_419: claro.

source: here.
es_419: toma.

source: well, you remember bas, right?
es_419: bueno, te acuerdas de bas, ¿verdad?

source: it really is him...
es_419: … de verdad es él…

source: oh. he said all that to you?
es_419: ah, ¿eso te decía?

source: just gotta make sure they are right where they need to be.
es_419: solo tengo que asegurarme de que estén donde deben estar.

source: hm? what man?
es_419: ¿mm? ¿qué hombre?

source: ...does rhea know?
es_419: ¿rhea lo sabe?…

source: a total of 17 men were captured and charged with assault, all of whom were injured at the scene.
es_419: "un total de 17 hombres fueron capturados y acusados por el ataque. todos resultaron heridos en la escena".

source: you can bring your friends over too if you want! having more girls around wouldn’t hurt... heh.
es_419: ¡si quieres, trae a tus amigas! no estaría mal que hubiera más chicas por aquí… je.

source: hm, what do you mean? weren’t you on the dating app awhile ago?
es_419: mmm, ¿cómo es eso? ¿no estabas en una aplicación de citas?

source: sorry about that.
es_419: lo siento.

source: i am?
es_419: ¿lo soy?

source: most of the time i’m just taking care of a special delivery or dropping people off.
es_419: por lo general, hago entregas especiales o llevo a la gente a alguna parte.

source: i was scared you’d never talk to me again and i didn’t know what to say.
es_419: me asustó que no volvieras a hablarme, por eso no sabía qué decir.

source: hey, why’d you look so sad? aren’t you having fun?
es_419: oye, tienes cara de triste. ¿no te diviertes?

source: wait, when can i leave? you haven’t told me yet-
es_419: espere, aún no me ha dicho cuándo puedo irme…

source: oh, phew. you two still look decent-
es_419: uf, qué alivio. aún están decentes…

source: even if you don’t want to talk to me...
es_419: aunque no quieras hablar conmigo…

source: wait... this guy...
es_419: espera… este tipo…

source: i didn’t think you’d go as far as to lie about your family like that. at least come up with something believable!
es_419: no pensé que llegarías a mentir así sobre tu familia. ¡al menos inventa algo creíble!

source: so maybe that means i have less to be afraid of, too?
es_419: eso significa que también tengo menos que temer, ¿no?

source: shiro and i are just friends, that’s it. we grew up together, lost touch and only started hanging out again recently.
es_419: shiro y yo solo somos amigos. crecimos juntos, perdimos el contacto y hace poco volvimos a vernos.

source: it’s fine. i really wanted to see you.
es_419: no hay problema. tenía ganas de verte.

source: wow, yeah, you’re right. you were like a baby back then...
es_419: uy, sí, tienes razón. eras un bebé en aquel entonces…

source: rhea? what are you doing here?
es_419: ¿rhea? ¿qué haces aquí?

source: c’mon, dinner’s on me, it won’t take long!
es_419: vamos, yo invito. ¡no será mucho tiempo!

source: ahh... what an unexpected guest.
es_419: aah… qué visitante tan inesperada.

source: i didn’t want to doubt you, but it’s getting harder to pretend...
es_419: no quiero dudar de ti, pero es difícil ignorar tantas cosas…

source: hey kid, have you had your five a day?
es_419: oye, chico, ¿comiste hoy tus verduras?

source: what...?
es_419: ¿qué…

source: you don’t understand, i think he was stabbed. he has to be in the hospital somehow.
es_419: usted no lo comprende, creo que lo apuñalaron. tiene que estar en el hospital.

source: so... i guess i’d just tell them to be careful, and to do the right thing, even when it’s hard.
es_419: conque… supongo que le diría que tuviera cuidado y que hiciera lo correcto, aunque sea difícil.

source: oh, my youber is here! that’s quick.
es_419: ¡ah, llegó mi yuber! qué rápido.

source: ah, can’t be late!
es_419: ¡uy, ya debo irme!

source: HEY man! what are you doing out here?
es_419: ¡eh, viejo! ¿qué estás haciendo aquí?

source: wait.
es_419: espera.

source: no, i was just curious.
es_419: no, solo tenía curiosidad.

source: a part of me knew...
es_419: una parte de mí supo...

source: y’know i asked you a question first, and you didn’t answer.
es_419: pero yo primero te hice una pregunta a ti y no respondiste.

source: it’s been two months since i moved back into the city.
es_419: ya pasaron dos meses desde que regresé a esta ciudad.

source: even i know this isn’t the most lavish place for lovebirds to meet-
es_419: hasta yo sé que este no es el lugar más elegante para unos tortolitos.

source: oh?
es_419: ¿eh?

source: go on ahead! i’ll take care of things from here.
es_419: ¡vete! yo me ocuparé de cerrar todo.

source: here, take the whole box, and make sure you use it, okay?
es_419: llévate la caja y asegúrate de usarla, ¿de acuerdo?

source: why don’t you come in and say hi?
es_419: ¿por qué no entras a saludarlo?

source: was i the only one with a horrible hairdo?
es_419: ¿era la única con un peinado horrible?

source: what we have tonight is urgent.
es_419: lo que tenemos hoy es urgente.

source: kori, you knew i was busy, i told you i was at work. it’s not something i can skip when i want to.
es_419: kori, sabías que tenía que trabajar. no puedo ignorar mi responsabilidad cuando me da la gana.

source: i’ll call you...
es_419: te llamaré…

source: you’re hurt.
es_419: estás herida.

source: you promised me it was over.
es_419: me dijiste que había acabado.

source: other times…
es_419: otras veces…

source: i don’t know what you remember, but recently there’s been a lot of... incidents, especially at night.
es_419: no sé qué recuerdas, pero últimamente ha habido muchos… incidentes, especialmente por la noche.

source: i’m sorry. are you okay?
es_419: lo siento. ¿estás bien?

source: if he can run, he must be fine. there are a dozen of them laying here, save these men first!
es_419: si puede correr, debe estar bien. hay una docena de personas tiradas aquí. ¡atiéndanlas primero!

source: actually, i’ll have twenty more of that, thanks.
es_419: me llevaré veinte más de esos, gracias.

source: and am i wrong?
es_419: ¿y me equivoco?

source: oh, okay. so... is it safe?
es_419: ah, entiendo. y… ¿es seguro?

source: y’know, we never got to finish that conversation.
es_419: no hemos terminado de hablar.

source: i have a feeling...
es_419: tengo una corazonada…

source: ...i know.
es_419: … lo sé.

source: you’re always hiding, you never let anyone in, even when someone is trying so hard to understand you, you just... you won’t let them.
es_419: siempre te escondes, no dejas que nadie se acerque, incluso cuando alguien se esfuerza tanto por entenderte, simplemente… no lo permites.

source: that’s his room right there. go on, i’ll leave you to it.
es_419: esa es su habitación. ve con él.

source: anyway, i have another shift in a few hours. i should really be going now.
es_419: bien, tengo otro turno en unas horas. ya debo irme.

source: but if someone is in trouble and you could do something about it, are you supposed to just watch?
es_419: pero si alguien está en problemas y uno puede hacer algo, ¿se supone que debe quedarse mirando?

source: y’know, they don’t exactly tell you this, but it’s hard meeting new friends out here.
es_419: ya sabes, nadie lo dice, pero es difícil hacer amigos aquí.

source: oh, sorry dear, i didn’t hear you come in. no one said we were having guests over today!
es_419: ah, lo siento. no te escuché entrar. ¡no sabía que tendríamos visitas hoy!

source: aw, work stuff again? well, you still gotta eat!
es_419: uuf, ¿de nuevo el trabajo? ¡pero tienes que comer!

source: you wanna know what i think, do you?
es_419: ¿quieres saber qué creo?

source: so... that was fun?
es_419: mm… estuvo bien, ¿no?

source: ah, it’s just a knife accident in the kitchen.
es_419: nada, un accidente con un cuchillo en la cocina.

source: that night... when i saw you again, a part of me knew things have changed.
es_419: la noche que te volví a ver… una parte de mí supo que algo había cambiado.

source: bas, this is Rhea, you remember her, i mentioned to you a few days ago-
es_419: ella es rhea, ¿la recuerdas? te la mencioné hace unos días.

source: you’re so loud...
es_419: bas, cómo gritas…

source: besides, we’re going hard tonight!
es_419: además, ¡será una noche superloca!

source: leave us alone!
es_419: ¡déjennos en paz!

source: he was here before you arrived, if you go after him now you can still catch him!
es_419: estaba aquí antes de que ustedes llegaran. ¡si lo buscan, lo encontrarán!

source: um, anyway... i guess you could say various people hire us for various reasons?
es_419: en fin, se podría decir que las personas nos contratan por distintas razones.

source: oh god... that was rough.
es_419: oh, cielos… qué embarazoso.

source: tch. don’t pretend like you don’t know who i am.
es_419: tch. no finjas que ignoras quien soy.

source: i mean, my hair is pretty cool too, though. the best part is it stays in shape rain or shine, talk about structural integrity!
es_419: mi pelo también es fantástico. lo mejor es que se queda así, pase lo que pase. ja, ¿qué me dices de la integridad estructural?

source: i got worried, and our friend hasn’t seen him either. i just wanted to know if he’s okay, that’s all.
es_419: me preocupé, y nuestro amigo tampoco lo ha visto. solo deseo saber si está bien.

source: this hand...!
es_419: ¡esta mano…!

source: dude, it’s two against one, we could have knocked him out. why’d you back off?
es_419: amigo, somos dos contra uno. podríamos haberlo noqueado. ¿por qué retrocediste?

source: not really, aside from an old friend i recently bumped into, literally.
es_419: la verdad es que no. solo a un viejo amigo al que encontré hace poco.

source: we’re done.
es_419: terminamos.

source: until we meet again!
es_419: ¡hasta el reencuentro!

source: ooh, they look awfully chummy.
es_419: aah, parecen estar muy unidos.

source: PICK ON SOMEONE YOUR OWN SIZE!
es_419: ¡métete con uno de tu tamaño!

source: at least six men were responsible for the attack last night, all who have been identified as members of a criminal gang that have been terrorising the city.
es_419: "al menos seis hombres fueron responsables del ataque de anoche. todos fueron identificados como integrantes de una banda criminal que está aterrorizando a la ciudad".

source: um... e-excuse me...?
es_419: eh… ¿c-cómo dice?

source: mm-hmm, neither do i.
es_419: ajá, yo tampoco.

source: it’s not just who he is seeing, it’s...
es_419: no es solo con quién sale, es…

source: ah. suddenly i don’t want this anymore...
es_419: ah. de repente ya no lo quiero…

source: the physics... it makes no sense...
es_419: la física… no tiene sentido…

source: please be okay.
es_419: por favor… que esté bien.

source: oh yeah! man it almost slipped my mind.
es_419: ¡ah, sí! vaya, casi lo olvido.

source: what do you think about the vigilantes they were talking about?
es_419: ¿qué opinas sobre los justicieros de los que hablaban?

source: help is here!
es_419: ¡es la ayuda!

source: so, that girl, rhea...
es_419: esa chica, rhea.

source: geez, girl, okay. chill out.
es_419: caramba, está bien. cálmate.

source: we’ve been doing this for so long, even if we tried to do things differently...
es_419: lo hemos hecho por tanto tiempo que, incluso si intentáramos cambiar las cosas…

source: though it has been almost a decade since i last saw you in person...
es_419: pasaron casi diez años desde la última vez que nos encontramos…

source: oh... i did?
es_419: ¿sí?

source: oh, that. i forgot about it.
es_419: ah, sí. pero ya la dejé.

source: i don’t actually know if it was him, but i’m quite sure it was. i’ve been trying to reach him all night but he hasn’t responded.
es_419: no estoy segura de si era shiro, pero creo que sí. he tratado de comunicarme con él por horas, pero no responde.

source: hmph, and to think a year ago when we started dating, i thought i was finally getting to know him better.
es_419: uf, y pensar que hace un año, cuando empezamos a salir, creí que al fin empezaba a conocerlo.

source: i thought she didn’t work on sundays?
es_419: ¿no dijo que no trabajaba los domingos?

source: of course! maybe your family might drop by during a road trip.
es_419: ¡claro! quizá tu familia pase por ahí en alguna excursión.
